; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph0 - mode
	thermograph3 - mode
	image1 - mode
	spectrograph2 - mode
	spectrograph4 - mode
	GroundStation1 - direction
	Star6 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star6)
	(supports instrument4 thermograph3)
	(supports instrument4 spectrograph4)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument5 thermograph3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument8 spectrograph2)
	(supports instrument8 spectrograph0)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 thermograph3)
	(calibration_target instrument10 GroundStation0)
	(calibration_target instrument10 Star5)
	(supports instrument11 image1)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(pointing satellite2 Star2)
	(pointing satellite3 Planet7)
	(have_image Planet7 spectrograph2)
	(have_image Planet8 spectrograph0)
	(have_image Star9 image1)
	(have_image Star10 spectrograph0)
	(have_image Phenomenon11 image1)
	(have_image Star12 spectrograph4)
))

)

; plan
1. (turn_to satellite3 planet7 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet7)
   goals met: 2 of 9
2. (turn_to satellite2 groundstation0 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 9
3. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 2 of 9
4. (calibrate satellite2 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 2 of 9
5. (turn_to satellite2 planet8 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet8)
   goals met: 2 of 9
6. (take_image satellite2 planet8 instrument7 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 3 of 9
7. (turn_to satellite2 phenomenon11 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 9
8. (turn_to satellite0 star3 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star3)
   goals met: 3 of 9
9. (take_image satellite2 phenomenon11 instrument7 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 9
10. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 9
11. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 4 of 9
12. (turn_to satellite0 planet7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet7)
   goals met: 4 of 9
13. (take_image satellite0 planet7 instrument2 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 5 of 9
14. (turn_to satellite0 star12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star12)
   goals met: 5 of 9
15. (take_image satellite0 star12 instrument2 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 6 of 9
16. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 6 of 9
17. (take_image satellite2 star10 instrument7 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 7 of 9
18. (turn_to satellite2 star9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star9)
   goals met: 7 of 9
19. (take_image satellite2 star9 instrument7 image1)
   added: (have_image star9 image1)
   goals met: 8 of 9
20. (turn_to satellite2 star2 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star2)
   goals met: 9 of 9
